celeritous/STM32F745VE_Module/STM32F745VE_Firmware/STM32F745VE/Inc/main.h
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * Copyright (c) 2018 STMicroelectronics International N.V. 
  * All rights reserved.
  *
  * Redistribution and use in source and binary forms, with or without 
  * modification, are permitted, provided that the following conditions are met:
  *
  * 1. Redistribution of source code must retain the above copyright notice, 
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of other 
  *    contributors to this software may be used to endorse or promote products 
  *    derived from this software without specific written permission.
  * 4. This software, including modifications and/or derivative works of this 
  *    software, must execute solely and exclusively on microcontroller or
  *    microprocessor devices manufactured by or for STMicroelectronics.
  * 5. Redistribution and use of this software other than as permitted under 
  *    this license is void and will automatically terminate your rights under 
  *    this license. 
  *
  * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" 
  * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT 
  * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A 
  * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
  * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT 
  * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
  * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
  * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, 
  * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF 
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING 
  * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
  * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H__
#define __MAIN_H__

/* Includes ------------------------------------------------------------------*/
#include "stm32f7xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private define ------------------------------------------------------------*/

#define GPIO_11_Pin GPIO_PIN_2
#define GPIO_11_GPIO_Port GPIOE
#define GPIO_12_Pin GPIO_PIN_3
#define GPIO_12_GPIO_Port GPIOE
#define GPIO_13_Pin GPIO_PIN_4
#define GPIO_13_GPIO_Port GPIOE
#define GPIO_22_Pin GPIO_PIN_13
#define GPIO_22_GPIO_Port GPIOC
#define GPIO_20_Pin GPIO_PIN_2
#define GPIO_20_GPIO_Port GPIOB
#define GPIO_14_Pin GPIO_PIN_7
#define GPIO_14_GPIO_Port GPIOE
#define GPIO_15_Pin GPIO_PIN_8
#define GPIO_15_GPIO_Port GPIOE
#define GPIO_16_Pin GPIO_PIN_10
#define GPIO_16_GPIO_Port GPIOE
#define GPIO_17_Pin GPIO_PIN_12
#define GPIO_17_GPIO_Port GPIOE
#define GPIO_18_Pin GPIO_PIN_14
#define GPIO_18_GPIO_Port GPIOE
#define GPIO_19_Pin GPIO_PIN_15
#define GPIO_19_GPIO_Port GPIOE
#define GPIO_3_Pin GPIO_PIN_8
#define GPIO_3_GPIO_Port GPIOD
#define GPIO_4_Pin GPIO_PIN_9
#define GPIO_4_GPIO_Port GPIOD
#define GPIO_5_Pin GPIO_PIN_10
#define GPIO_5_GPIO_Port GPIOD
#define GPIO_6_Pin GPIO_PIN_11
#define GPIO_6_GPIO_Port GPIOD
#define GPIO_7_Pin GPIO_PIN_14
#define GPIO_7_GPIO_Port GPIOD
#define GPIO_8_Pin GPIO_PIN_15
#define GPIO_8_GPIO_Port GPIOD
#define GPIO_0_Pin GPIO_PIN_3
#define GPIO_0_GPIO_Port GPIOD
#define GPIO_1_Pin GPIO_PIN_4
#define GPIO_1_GPIO_Port GPIOD
#define GPIO_2_Pin GPIO_PIN_7
#define GPIO_2_GPIO_Port GPIOD
#define GPIO_21_Pin GPIO_PIN_4
#define GPIO_21_GPIO_Port GPIOB
#define GPIO_9_Pin GPIO_PIN_0
#define GPIO_9_GPIO_Port GPIOE
#define GPIO_10_Pin GPIO_PIN_1
#define GPIO_10_GPIO_Port GPIOE

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the 
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1U */

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
 extern "C" {
#endif
void _Error_Handler(char *, int);

#define Error_Handler() _Error_Handler(__FILE__, __LINE__)
#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
